# 这就是ChatGPT
第一篇
  ChatGPT 在做什么？它为何能做到这些？ / 1
  它只是一次添加一个词 / 3
  概率从何而来 / 10
  什么是模型 / 16
  类人任务（human-like task）的模型 / 19
  神经网络 / 22
  机器学习和神经网络的训练 / 35
  神经网络训练的实践和学问 / 42
  "足够大的神经网络当然无所不能！" / 51
  "嵌入"的概念 / 56
  ChatGPT 的内部原理 / 64
  ChatGPT 的训练 / 75
  在基础训练之外 / 79
  真正让ChatGPT 发挥作用的是什么 / 82
  意义空间和语义运动定律 / 89
  语义语法和计算语言的力量 / 96
  那么，ChatGPT 到底在做什么？它为什么能做到这些？ / 102
  致谢 / 105
第二篇
  利用Wolfram|Alpha 为ChatGPT 赋予计算知识超能力 / 107
  ChatGPT 和Wolfram|Alpha / 109
  一个简单的例子 / 111
  再举几个例子 / 115
  前方的路 / 129
  相关资源 / 134
